---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceOriginX
source: html/43255f21-f4e1-2a9e-cb0d-fba6e7080129.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceOriginX Property

"Origin (X)"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceOriginX { get; }
```